app/views/relationships/index.html.haml

            = link_to relationship.followed_user.full_name, relationship.followed_user
          %td.extra-padding=  relationship.followed_user.queue_items.count
---
SELECT COUNT(*) FROM "queue_items"  WHERE "queue_items"."user_id" = $1  [["user_id", 2]]