app/views/relationships/index.html.haml

SELECT COUNT(*) FROM "relationships"  WHERE "relationships"."follower_id" = $1  [["follower_id", 2]]
---
          %td.extra-padding follower.queue_items.count
          %td.extra-padding follower.followed_user_relationships.count