app/views/users/show.html.haml

SELECT COUNT(*) FROM "queue_items"  WHERE "queue_items"."user_id" = $1  [["user_id", 2]]
---
          %img(src="http://www.gravatar.com/avatar/#{Digest::MD5.hexdigest('knwang@gmail.com'.downcase)}?s=40")
          %h2= "#{@user.full_name}'s video collections (#{@user.queue_items.count})"

SELECT "queue_items".* FROM "queue_items"  WHERE "queue_items"."user_id" = $1  ORDER BY position  [["user_id", 2]]
---
          %tbody
            - @user.queue_items.each do |item|

SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."user_id" = $1  [["user_id", 2]]
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."user_id" = $1  [["user_id", 2]]
---
      %header
        %h3= "#{@user.full_name}'s Reviews (#{@user.reviews.count})"
      %ul
        - @user.reviews.each do |r|