app/views/videos/index.html.haml

SELECT "videos".* FROM "videos"  WHERE "videos"."category_id" = $1  ORDER BY title  [["category_id", 1]]
---
    .videos.row
      - category.videos.each do |video|
        .video.col-sm-2