app/views/videos/show.html.haml

      %header
        %h3 User Reviews (#{@video.reviews.count})
      %ul
        - @video.reviews.each do |review|
---
SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."video_id" = $1  [["video_id", 1]]
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."video_id" = $1  ORDER BY created_at DESC  [["video_id", 1]]