app/controllers/invited_users_controller.rb

SELECT  "invitations".* FROM "invitations"  WHERE "invitations"."token" = '1234' LIMIT 1
---
  def new
    @invitation = Invitation.find_by(token: params[:token] )