app/controllers/invitations_controller.rb

INSERT INTO "invitations" ("created_at", "friend_email", "friend_name", "message", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2016-12-10 18:48:37.001082"], ["friend_email", "pete@example.com"], ["friend_name", "pete"], ["message", "hey"], ["updated_at", "2016-12-10 18:48:37.001082"], ["user_id", 15]]
---
  def create
    invitation_atts = { user: current_user,
                        friend_name: params[:friend_name],
                        friend_email: params[:friend_email],
                        message: params[:message] }
    @invitation = Invitation.new(invitation_atts)

    if @invitation.save