app/controllers/queue_items_controller.rb

SELECT  "videos".* FROM "videos"  WHERE "videos"."id" = $1 LIMIT 1  [["id", 21]]
---
  def create
    video = Video.find(params[:video_id])

DELETE FROM "queue_items" WHERE "queue_items"."id" = $1  [["id", 2]]
---
  def destroy
    QueueItem.destroy(params[:id]) if in_user_queue?(params[:id])