app/controllers/relationships_controller.rb

  def create
    Relationship.create(follower: current_user, followed_user: User.find(params[:id]))
---
INSERT INTO "relationships" ("created_at", "followed_user_id", "follower_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2016-12-08 04:11:44.469014"], ["followed_user_id", 2], ["follower_id", 3], ["updated_at", "2016-12-08 04:11:44.469014"]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "relationships".* FROM "relationships"  WHERE "relationships"."follower_id" = $1  [["follower_id", 3]]