app/controllers/relationships_controller.rb

SELECT  "relationships".* FROM "relationships"  WHERE "relationships"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "relationships" WHERE "relationships"."id" = $1  [["id", 1]]
---
  def destroy
    relationship = Relationship.find(params[:id])
    relationship.destroy if relationship.follower == current_user