app/controllers/reset_passwords_controller.rb

  def new
    @token = params[:token]
    redirect_to invalid_token_path unless User.find_by(token: @token)
---
SELECT  "users".* FROM "users"  WHERE "users"."token" = '1234' LIMIT 1

  def create
    user = User.find_by(token: params[:token])
    if user
      user.password = params[:password]
      user.save
---
SELECT  "users".* FROM "users"  WHERE "users"."token" = 'zq1IH8ZDkEkikPLvM03VzQ' LIMIT 1
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = 15  [["password_digest", "$2a$10$YDRzl3e6GTsC9JO2PncsMO63dIr6xicJfpLGs.Pibt2J/Y8FnfWqG"], ["updated_at", "2016-12-09 19:26:30.479480"]]