app/controllers/reviews_controller.rb

  def create
    @video = Video.find( params[:video_id] )
    review = @video.reviews.new(review_params.merge!(user: current_user))
    if review.save
---
SELECT  "videos".* FROM "videos"  WHERE "videos"."id" = $1 LIMIT 1  [["id", 15]]
INSERT INTO "reviews" ("body", "created_at", "rating", "updated_at", "user_id", "video_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "Excellente!"], ["created_at", "2016-12-04 06:58:37.552018"], ["rating", 4], ["updated_at", "2016-12-04 06:58:37.552018"], ["user_id", 1], ["video_id", 15]]