app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "full_name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2016-12-01 05:05:36.469155"], ["email", ""], ["full_name", ""], ["updated_at", "2016-12-01 05:05:36.469155"]]
---
  def create
    @user = User.new(user_params)

    if @user.save