app/views/categories/show.html.haml

SELECT "videos".* FROM "videos"  WHERE "videos"."category_id" = $1  [["category_id", 2]]
---
  %article.row
    - @category.videos.each do |video|
      .video.col-md-2